# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [4]:
df['age'].mean(axis = 0)

3.4375

In [12]:
df.sort_values(by = ['age'], ascending = True)
df.sort_values(by = ['visits'], ascending = False)

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
g  snake  4.5       1       no
h    cat  NaN       1      yes
j    dog  3.0       1       no

In [13]:
df.replace(['yes', 'no'], [True, False])

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [15]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.421055  0.292146  0.848639
1  0.472420  0.270467  0.011958
2  0.667544  0.982589  0.228359
3  0.165206  0.981633  0.066316
4  0.649007  0.916767  0.153379

In [18]:
df_mean = df.mean()
df - df_mean

          0         1         2
0 -0.053991 -0.396574  0.586909
1 -0.002627 -0.418254 -0.249772
2  0.192498  0.293869 -0.033371
3 -0.309841  0.292912 -0.195414
4  0.173961  0.228047 -0.108351

In [23]:
df.mean().mean()

0.4751656361849164

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [24]:
df

          0         1         2
0  0.421055  0.292146  0.848639
1  0.472420  0.270467  0.011958
2  0.667544  0.982589  0.228359
3  0.165206  0.981633  0.066316
4  0.649007  0.916767  0.153379

In [37]:
df.sum(axis = 0).idxmin()

2

In [36]:
df.sum(axis = 1).idxmin()

1

進階題

In [40]:
score_df = pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

1.6號學生(student_id=6)3科平均分數為何?

In [47]:
score_df.loc[6].mean()

56.333333333333336

2. 6號學生3科平均分數是否有贏過班上一半的同學

In [57]:
num6 = score_df.loc[6].mean()
median = (score_df.sum(axis = 1) / 3).median()

if num6 > median:
    print('Yes')
else:
    print('No')

No

由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?

In [60]:
score_df = score_df.apply(lambda x: x**(0.5)* 10)
score_df.loc[6]

math_score       93.814271
english_score    92.586831
chinese_score    92.799436
Name: 6, dtype: float64

承上題，加分後各科班平均變多少

In [68]:
score_df.mean()

math_score       92.505302
english_score    93.866342
chinese_score    94.034256
dtype: float64